app/views/statuses/_form.html.erb

SELECT "users".* FROM "users"
---
<!-- thank you, internet tutorials for this...! -->
<%= f.input :user_id, collection: User.all, label_method: :full_name %>