app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First status test"], ["created_at", "2014-09-20 21:59:43.925515"], ["name", "Adam"], ["updated_at", "2014-09-20 21:59:43.925515"]]
---
  def create
    @status = current_user.statuses.new(status_params)

    respond_to do |format|
      if @status.save

SELECT  "statuses".* FROM "statuses"  WHERE "statuses"."user_id" = ? AND "statuses"."id" = ? LIMIT 1  [["user_id", 2], ["id", 5]]
UPDATE "statuses" SET "content" = ?, "updated_at" = ? WHERE "statuses"."id" = 1  [["content", "First status test!"], ["updated_at", "2014-09-20 21:59:54.318695"]]
---
  def update
    @status = current_user.statuses.find(params[:id])
    if params[:status] && params[:status].has_key?(:user_id)
      params[:status].delete(:user_id)
    end

    respond_to do |format|
      if @status.update(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 2]]
---
  def destroy
    set_status
    @status.destroy